In [2]:
import numpy as np
import pandas as pd

In [65]:
df1 = pd.read_csv('LS_Group03/Class1.txt', sep=' ', header=None, names=['A', 'B'])
df2 = pd.read_csv('LS_Group03/Class2.txt', sep=' ', header=None, names=['A', 'B'])
df3 = pd.read_csv('LS_Group03/Class3.txt', sep=' ', header=None, names=['A', 'B'])

In [66]:
df1

          A        B
0    15.258  0.11508
1    16.671 -1.07230
2    16.733  1.57740
3    14.472 -0.28159
4    15.268  0.65322
..      ...      ...
495  19.043  0.27231
496  18.836  0.46112
497  16.777 -2.69030
498  15.613  1.80190
499  11.272 -3.78230

[500 rows x 2 columns]

In [67]:
df2

          A        B
0    7.4914 -12.5550
1    4.0181  -7.3413
2    2.9821 -12.0150
3    5.3682 -10.7970
4    6.9905 -11.0180
..      ...      ...
495  6.2212 -10.0990
496  5.8822  -8.8714
497  5.8921 -13.6150
498  3.9162 -13.1660
499  6.5769 -11.1290

[500 rows x 2 columns]

In [68]:
df3

           A        B
0   -2.42480 -0.79712
1   -0.72760  0.58344
2   -3.14410 -3.11240
3   -1.98500  5.70980
4   -2.40810  0.81910
..       ...      ...
495  0.29237 -0.13298
496 -2.82220 -5.22530
497 -2.81640  2.23000
498 -0.48128  0.55263
499 -0.89690 -1.46360

[500 rows x 2 columns]

In [69]:
mean1 = df1.mean().values
mean2 = df2.mean().values
mean3 = df3.mean().values

In [70]:
print(mean1, " ", mean2, " ", mean3)

[16.041666   -0.05410826]   [  6.03712828 -12.0409062 ]   [-0.99362025  2.05114917]

In [71]:
cov1 = np.cov(df1.values.T)
cov2 = np.cov(df2.values.T)
cov3 = np.cov(df3.values.T)

In [75]:
print(cov1, "\n\n\n", cov2, "\n\n\n", cov3)

[[8.57638362 3.01063963]
 [3.01063963 2.32545248]]


 [[ 3.03979616 -1.62096262]
 [-1.62096262  4.42147128]]


 [[1.97008637 1.64243801]
 [1.64243801 9.67089938]]

In [76]:
prior1 = prior2 = prior3 = 1/3

In [77]:
def classifier(X, mean, cov, prior):
    d = mean.size
    return prior * (1/(pow(2 * np.pi, d/2)) * pow(np.linalg.det(cov), 1/2)) * np.exp((-1/2)*(X-mean).T @ (np.linalg.inv(cov)) @ (X-mean))

def predict(X):
    p1 = np.array([classifier(x, mean1, cov1, prior1) for x in X])
    p2 = np.array([classifier(x, mean2, cov2, prior2) for x in X])
    p3 = np.array([classifier(x, mean3, cov3, prior3) for x in X])

    return np.argmax(np.array([p1, p2, p3]), axis = 0)

In [63]:
classifier([1, 2], mean1, cov1, prior1)

np.float64(2.0271305147106842e-16)